<?php

$_lang['mse.tpl'] = 'Чанк оформления результатов поиска.';
$_lang['mse.limit'] = 'Ограничение вывода количества результатов. Используется для постраничной навигации.';
$_lang['mse.offset'] = 'Пропуск результатов от начала. Используется для постраничной навигации.';
$_lang['mse.outputSeparator'] = 'Разделитель вывода результатов. Используется для постраничной навигации.';
$_lang['mse.totalVar'] = 'Имя плейсхолдера для выствления количества найденных результатов. Используется для постраничной навигации.';
$_lang['mse.queryVar'] = 'Имя перемнной, в которой содержится поисковый запрос. По умолчанию - query, то есть, сниппет будет работать с $_REQUEST[\'query\']';
$_lang['mse.parentsVar'] = 'Имя перемнной, в которая укзывает ограничение по родителям для поиска. По умолчанию - parents, то есть, сниппет будет работать с $_REQUEST[\'parents\']';
$_lang['mse.minQuery'] = 'Минимальное количество символов для начала поиска';
$_lang['mse.returnIds'] = 'Если включено - вместо оформленных результатов поиска сниппет вернет список id найденных ресурсов, через запятую. Можно использовать для вывода результатов другими сниппетами, типа getResources.';
$_lang['mse.plPrefix'] = 'Префикс для плейсхолдеров в чанках.';
$_lang['mse.tvPrefix'] = 'Префикс для ТВ параметров в чанках.';
$_lang['mse.includeTVs'] = 'Извлекать ТВ параметры ресурсов для обработки в чанке? По умолчанию - нет.';
$_lang['mse.includeTVList'] = 'Список ТВ параметров для извлечения. По умолчанию - нет.';
$_lang['mse.includeMS'] = 'Извлекать параметры ресурсов-товаров из таблиц miniShop? По умолчанию - нет.';
$_lang['mse.context'] = 'Контекст для работы. По умолчанию - текущий.';

